Update docs/diagrams.md
